#language: ru

Функционал: Поиск
  Структура сценария: Поиск товара по расширенному фильтру

    Когда выполнен переход на главную страницу
    Когда выбирается пункт верхнего меню Яндекс сервисов: "Маркет"
    Когда выбирается пункт верхнего меню категорий товаров: "Электроника"
    Когда приостановлено выполнение на "2" секунд
    Когда в боковом левом меню для пункта "<leftMenuItem>" выбран подпункт "<leftMenuSubItem>"
    Когда приостановлено выполнение на "2" секунд

  Примеры:
  |leftMenuItem|leftMenuSubItem|
  |Аудио- и видеотехника|Телевизоры|
  |Портативная техника|Наушники и Bluetooth-гарнитуры|


